
#                           ТИПЫ ДАННЫХ
#                   Баары 8 тип данных бар.
#                   5-ОЗГОРБОРЙТ , 3-ОЗГОРОТ


#                          ОЗГОРБОЙ ТУРГАНДАР  ( int , float , str , bool , tuple() )

#1 int  - 547678 645645(сандарга колдонулат)
#2 float  - 654.654 645.645(болчок сандарга колдонулат)
    # +   -       *            [/ // %]            [**]
    # round()(кобунчо болчок сандар менен иштейт) сандын болчокторун азайтат
           #мисалы: print(round(0.56564164464, 2)) жообу: 0,56

#3 str  - 'hgjsdfhgk' "gdsfgdsg" (тамгаларга колдонулат, 1 тырнакча же 2 тырнакча)
    # lower()  (баардык тамгаларды кичирейтет)
    # upper()    (баардык тамгаларды чонойтот)
    # title()   (баардык создордун башкы тамгаларын чонойтот)
    # capitalize() (биринчи создун башкы тамгасын чонойтот)
    # replace (озгортот)  мысалы:  PyThon  создогу о  тамгасын   а  га алмаштырык
          #print('PyThon'. replace('o', 'a'))
          #ЖООБУ::  PyThan

    # len()  (жалпы узундугун табып берет)
          #мисалы: print(len('IDRIS'))    ЖООБУ: 5   (5 тамга бар дегени)
    # count() (канча окшоштор бар экенин табып берет)
       #мисалы:  print('IDRIS'.count(I))   ЖООБУ: 2          ( I )  тамгасынан  2 бар
    # split() -  ажыратат
    # join()     бириктирет


    # (f)  формат  -  переменныйдын ичине соз кошот,  кошумча соз кошсок болот
          # cars = ['tesla', 'volvo', 'bmw', 'audi', 'mers']
          # print(f'узунудугу {len(cars[-1])} соз')

    # in - переменныйдын ичинде барбы жокпу  билип берет
          #cars = ['tesla', 'volvo', 'bmw', 'audi', 'mers']
          #word = input('Название марки: ')
          #if word in cars:
          #    print('Бар')
          #else:
          #    print('Жок')

#4 bool -   True , False   (# > < == !=) эки элементти салыштырат

#5 tuple() - толтурганда ()
     # sorted() - сорттировка кылат
     # index() - (индексин)ордун табып берет
     # +  - кошот
     # max() - максимальный табып берет
     # min() - минимальный табып берет
     # sum() - суммасын табып берет
     # len() - жалпы узундугун табып берет
     # count() - канча окшоштор бар экенин табып берет
     # [::-1] - тескери кылат  (баардык тип данных менен иштейт)


#                        ОЗГОРО ТУРГАНДАР ( set(), list[], dict{} )


#6 list  - [] [534534,5345,34]
     # append()
     # insert()
     # remove()
     # pop()
     # del()
     # clear()
     # sort()
     # reverse()
     # extend()
     # sorted() сорттировка кылат
     # index() (индексин)ордун табып берет
     # +      кошот
     # max()  максимальный табып берет
     # min()  минимальный табып берет
     # sum()  суммасын табып берет
     # len() - жалпы узундугун табып берет
     # count() - канча окшоштор бар экенин табып берет
     # [::-1] - тескери кылат  (баардык тип данных менен иштейт)

#7 set     - окшошторду бириктирип коет
    # set() - пустой set , толтурганда {}
    # union() - эки set ти  бириктирет
    # add() - set тин ичине кошот
    # remove() -  элементтин озун очурот
    # discard() - элементтин озун очурот

#8 dict {}
    # {5345: 654645, "gsdg": 543, "fsdgf": 'dsfs'}
    # remove()
    # pop()
    #

'''
#1: Python basic
DATA TYPES (8)
2 = ИЗМЕН(ОЗГОРУЛОТ 3) НЕИЗМЕН(ОЗГОРУЛБОЙТ 5)

ИЗМЕН(ОЗГОРУЛОТ) 3:
list [] [654,5645,645654] appned(), insert() remove() pop() del
dict {} {5345: 654645, "gsdg": 543, "fsdgf": 'dsfs'} [new_keys] remove() pop()
set set() {5, 6, 3, 7, 2}  union(), add() remove() discard()

НЕИЗМЕН(ОЗГОРУЛБОЙТ 5):
int 543 -534
float 534.534 -53.543
str "gdgds" 'gsdgds'
bool True False
tuple () (5,345435,435)
'''